modules/News/Models/News.php

select * from `core_news_tag` where `news_id` = 49 and `core_news_tag`.`deleted_at` is null
---
    public function getTags()
    {
        $tags = NewsTag::where('news_id', $this->id)->get();

update `core_news_tag` set `deleted_at` = '2025-03-02 16:16:29', `core_news_tag`.`updated_at` = '2025-03-02 16:16:29' where 1 = 1 and `news_id` = 49 and `core_news_tag`.`deleted_at` is null
---
    public function saveTag($tags_name, $tag_ids)
    {

        if (empty($tag_ids))
            $tag_ids = [];
        $tag_ids = array_merge(Tag::saveTagByName($tags_name), $tag_ids);
        $tag_ids = array_filter(array_unique($tag_ids));
        // Delete unused
        NewsTag::whereNotIn('tag_id', $tag_ids)->where('news_id', $this->id)->delete();