app/Http/Livewire/AgentCustomerToggle.php

    public function init() {
        $this->users =  User::where('role_id',3)->where('booking_agent', $this->agent)->get();
---
select * from `users` where `role_id` = 3 and `booking_agent` = 1 and `users`.`deleted_at` is null