app/Helpers/AppHelper.php

select * from `notifications` where (`for_admin` = 1 or `notifiable_id` = 1) order by `created_at` desc limit 5
select count(*) as aggregate from `notifications` where (`for_admin` = 1 or `notifiable_id` = 1) and `read_at` is null limit 5
---
    function getNotify()
    {
        $checkNotify = \Modules\Core\Models\NotificationPush::query();
        if(is_admin()){
            if (Auth::id() == 1) {
                $checkNotify->where(function ($query) {
                    $query->where('for_admin', 1);
                    $query->orWhere('notifiable_id', Auth::id());
                });
            }
            else {
                $checkNotify = \App\Models\DriverNotifications::query();
            }
        }else{
            $checkNotify->where('for_admin',0);
            $checkNotify->where('notifiable_id', Auth::id());
        }
        $notifications = $checkNotify->orderBy('created_at', 'desc')->limit(5)->get();
        if (Auth::id() == 1) {
            $countUnread = $checkNotify->where('read_at', null)->count();