modules/Dashboard/Admin/DashboardController.php

select * from `contact_infos`
select * from `partners` where `partners`.`id` in (2)
---
    public function getContacts () {
        $contacts = ContactInfo::with('partners')->get();