modules/Report/Admin/BookingController.php

            'booking_update'        => $this->hasPermission('booking_update'),
            'statues'               => config('booking.statuses'),
            'spaces' => Space::all(),
            'customers' => User::where('role_id',3)->get(),
---
select * from `users` where `role_id` = 3 and `users`.`deleted_at` is null