modules/Core/Models/Settings.php

select * from `core_settings` where `name` = 'map_provider' limit 1
---
    public static function item($item, $default = false)
    {
        if($item == 'wallet_module_disable'){
            return false;
        }
        $value = Cache::rememberForever('setting_' . $item, function () use ($item ,$default) {
            $val = Settings::where('name', $item)->first();